000_РОЗНИЦА_ЦЕНТР/src/Catalogs/СотрудникиКоллЦентра/СотрудникиКоллЦентра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СотрудникиКоллЦентра</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>РольСотрудника</name>
    <type>
      <types>EnumRef.РолиСотрудниковКоллЦентра</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказыПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаботает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУведомленияОЗвонке</name>
    <type>
      <types>EnumRef.ВидыУведомленийВходящегоЗвонка</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыУведомленийВходящегоЗвонка/ВидыУведомленийВходящегоЗвонка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУведомленийВходящегоЗвонка</name>
  <enumValues>
    <name>НеУведомлять</name>
  </enumValues>
  <enumValues>
    <name>ОбычноеУведомление</name>
  </enumValues>
  <enumValues>
    <name>ОткрыватьОкноЗвонка</name>
  </enumValues>
  <enumValues>
    <name>УведомлятьИОткрыватьОкно</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/СотрудникиКоллЦентра/ManagerModule.bsl
Функция ПолучитьСотрудникаПользователя(Пользователь) Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиКоллЦентра.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.СотрудникиКоллЦентра КАК СотрудникиКоллЦентра
	|ГДЕ
	|	СотрудникиКоллЦентра.Владелец = &Пользователь
	|	И СотрудникиКоллЦентра.ПометкаУдаления = ЛОЖЬ
	|
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиКоллЦентра.Ссылка";
	Запрос.УстановитьПараметр("Пользователь", Пользователь); //Пользователь
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда 
		Возврат Результат.Сотрудник;
	Иначе 
		Возврат Справочники.СотрудникиКоллЦентра.ПустаяСсылка();
	КонецЕсли;	
	
КонецФункции

Функция ПолучитьВидУведомленияСотрудника(Пользователь) Экспорт  

	Сотрудник = ПолучитьСотрудникаПользователя(Пользователь);
	
	Если Сотрудник = Справочники.СотрудникиКоллЦентра.ПустаяСсылка() Тогда 
		Возврат Перечисления.ВидыУведомленийВходящегоЗвонка.НеУведомлять;
	КонецЕсли;	                                                         
	
	Возврат Сотрудник.ВидУведомленияОЗвонке;
	
КонецФункции

Функция ПолучитьСотрудникаПоВнутренниемуНомеру(ВнутреннийНомер) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиКоллЦентра.Ссылка КАК Сотрудник
	|ИЗ
	|	Справочник.СотрудникиКоллЦентра КАК СотрудникиКоллЦентра
	|ГДЕ
	|	СотрудникиКоллЦентра.ВнутреннийНомер = &ВнутреннийНомер
	|	И СотрудникиКоллЦентра.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("ВнутреннийНомер", СокрЛП(ВнутреннийНомер)); //Строка 
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда 
		Возврат Результат.Сотрудник;	
	Иначе 
		Возврат Справочники.СотрудникиКоллЦентра.ПустаяСсылка();	
	КонецЕсли;	
	
КонецФункции
